{
  "projects": [
    {
      "title": "Shape Channels",
      "img": "/img_channels.png",
      "description": "Channels is a dedicated messaging app for clear and organized project communication for construction teams. Keep all your conversations, files, photos, issues, and progress updates in one easily accessible location. Track down information quickly and ensure everyone is on the same page. Enhanced Visibility: Gain a clear view of project progress with photos, updates, and discussions in one place",
      "fullDescription": "Shape: Channels is a core communication platform built for the construction industry, designed to streamline day-to-day collaboration on active job sites. As part of the broader Shape construction field management software by Laminar, the Channels product enables construction professionals—from on-site workers to project managers—to share progress updates, media, and discussions in real-time.<br><br><span class='font-bold  font-montserrat'>Monorepo Architecture:</span><br>The codebase followed a monolith architecture where both the web application (ReactJS) and mobile application (React Native with Expo) resided within the same folder structure. This allowed for consistent UI/UX components, shared logic, and simplified developer workflows across platforms.",
      "alt": "Shape Channels Img",
      "role": "Full-stack JavaScript Developer (Monorepo Focus)",
      "tags": ["messaging", "communication"],
      "techStack": [
        "React Native",
        "Typescript",
        "Tanstack-Query",
        "Expo",
        "Stream Chat SDK",
        "native modules",
        "Storybook"
      ],
      "features": [
        "Real-time messaging and notifications using Stream Chat SDK",
        "Project-based conversations",
        "File and document sharing",
        "single monolithic codebase for both Mobile and Web"
      ],
      "links": {
        "android": "https://play.google.com/store/apps/details?id=shapeconstruction.channels.production",
        "iOS": "https://apps.apple.com/us/app/shape-channels/id6497407147",
        "website": "https://www.shape.construction/"
      }
    },
    {
      "title": "Platable",
      "img": "/img_platable.png",
      "description": "Every day, delicious food from your favorite spots goes to waste because it does not get sold. With Platable, you can snag Surprise Bags filled with quality eats, save some cash, and do your part to help reduce food waste.",
      "fullDescription": "Platable is a full-stack food delivery and ordering platform that aimed to test product-market fit through a cross-platform mobile solution. The application offered users an intuitive interface to browse restaurants, track deliveries in real time, and make seamless payments — all built with a focus on performance, scalability, and user experience.<br><br><span class='font-bold font-montserrat'>Phase 1: MVP with Flutter</span><br> Designed and developed the initial MVP using Flutter, targeting both Android and iOS platforms with a unified codebase.<br>Led the entire mobile development effort — from feature implementation to deployment on the Play Store and App Store.<br>Maintained and supported the app post-launch for 6 months, ensuring it remained stable while gathering real-world user feedback.<br><br><span class='font-bold  font-montserrat'>Key Features:</span><br>Google Maps integration for delivery tracking and live rider locations.<br>Marker clustering and dynamic updates for restaurants and delivery agents.<br>Stripe integration for secure payments.<br>Analytics setup using Google Analytics, Customer.io, and other tracking SDKs to monitor usage, funnels, and conversions.<br><br><span class='font-bold font-montserrat'> Phase 2: Migration to Native Android</span><br>After one year of iterative development and extensive testing:<br> Migrated the app from Flutter to native Android using Jetpack Compose, Kotlin, and Coroutines, resulting in a significant performance boost and improved user experience.<br>Rebuilt the entire mobile application from the ground up, while preserving functional parity and enhancing responsiveness.<br>Maintained 99%+ crash-free sessions and reduced app load times by optimizing rendering and network handling.",
      "alt": "Platable Img",
      "role": "Lead Mobile Developer",
      "tags": ["food delivery"],
      "techStack": [
        "Flutter",
        "Dart",
        "GetX",
        "Firebase",
        "Stripe",
        "Jetpack Compose",
        "Kotlin",
        "MVVM",
        "Coroutines",
        "Hilt",
        "Retrofit",
        "Compose-Destinations"
      ],
      "features": [
        "Guest user and logged-in user support",
        "Google Maps Clustering, location tracking, and order tracking",
        "Payment Processing with Stripe",
        "Firebase Cloud Messaging for real-time updates",
        "Firebase Crashlytics for error tracking",
        "Analytics for user behavior tracking",
        "Built with flutter and later upgraded to native android and iOS"
      ],
      "links": {
        "android": "https://play.google.com/store/apps/details?id=com.platablenow.platable",
        "iOS": "https://apps.apple.com/us/app/platable/id6502869376",
        "website": "https://www.platablenow.com/"
      }
    },
    {
      "title": "Kalido: the opportunities app",
      "img": "/img_kalido.png",
      "description": "Kalido is an amazing AI powered platform that creates abundant opportunities for individuals in enterprises and communities. Our intuitive tools match your skills to people, teams, projects and jobs to surface economic, professional and social opportunities that would otherwise stay hidden.",
      "fullDescription": "Kalido is an enterprise-grade communication and collaboration platform serving multiple business clients with tailored solutions. The platform required a major overhaul to scale efficiently, improve onboarding for new developers, and meet evolving client demands.<br><br><span class='font-bold font-montserrat'>Key Contributions:</span><br><br><span class='font-semibold font-montserrat'>Android Platform Rewrite:</span><br>Led the complete rewrite of the Android application, modernizing the codebase using the latest Android architectural principles such as MVVM, Jetpack Libraries, and Dependency Injection.<br>Significantly improved code maintainability, modularity, and onboarding speed — new developers were able to contribute within days due to the clean and well-structured architecture.<br>Ensured high testability and scalability by introducing separation of concerns and lifecycle-aware components.<br><br><span class='font-semibold font-montserrat'>Feature Delivery & Client Impact:</span><br>Owned and delivered critical Android features under tight timelines, directly influencing successful feature rollouts to new clients.<br>Managed production releases and build pipelines, maintaining app stability and quality across environments.<br><br><span class='font-semibold font-montserrat'>Introducing Flutter to the Organization:</span><br>Pioneered the introduction of Flutter within the company to solve internal tooling requirements.<br>Spearheaded the development of a custom HRMS portal using Flutter, reducing the organization's dependency on external SaaS HR tools.<br>Acted as the technical mentor for Flutter adoption, guiding the team on architecture, state management, and deployment.",
      "alt": "Kalido Img",
      "role": "Lead Android Developer",
      "tags": ["talent Management", "HRMS"],
      "techStack": [
        "Kotlin",
        "Jetpack Compose",
        "MVVM",
        "Coroutines",
        "Hilt",
        "Retrofit",
        "Compose-Destinations"
      ],
      "features": [
        "AI-powered matching of skills to opportunities",
        "Jetpack compose for modern UI development",
        "Linkedin like profile creation and management",
        "Real-time notifications and updates",
        "Android powered with Kotlin and Modern Android Architecture"
      ],
      "links": {
        "android": "https://play.google.com/store/apps/details?id=me.kalido.android",
        "iOS": "https://apps.apple.com/in/app/kalido-the-opportunity-app/id961851767",
        "website": "https://www.kalido.me/"
      }
    },
    {
      "title": "Habit Tracker : HabitBoard",
      "img": "/img_habit_board.png",
      "description": "Welcome to HabitBoard the premier habit tracking application carefully crafted to facilitate your journey towards personal growth and self-improvement!",
      "fullDescription": "HabitBoard is a personal productivity tool designed and developed entirely by me using the Flutter framework. Built with a strong focus on habit formation and intuitive visual tracking, the app helps users monitor and maintain their daily routines. The app features a highly customizable calendar view, daily progress tracking, and seamless local data persistence.<br> <br> <span class='font-bold font-montserrat'>Key Features & Contributions:</span><br><br><span class='font-semibold font-montserrat'>Cross-platform Mobile App (Flutter):</span><br>Built using Flutter to support both iOS and Android from a single codebase.<br>Delivered a smooth and responsive UI tailored for self-discipline, consistency, and minimal distractions.<br><br><span class='font-bold font-montserrat'>Local Database & State Management:</span><br>Implemented efficient local data storage using SQLite and shared preferences for fast and offline-first performance.<br>Designed custom models and logic for handling streaks, recurring habits, and completion history.<br><br><span class='font-bold font-montserrat'>Custom Calendar System:</span><br>Built a custom calendar UI to visualize daily habit progress, color-coded states, and weekly/monthly summaries.<br>Integrated animated interactions and smooth scrolling for enhanced user experience.<br><br><span class='font-bold font-montserrat'>Platform Integration & Stability:</span><br>Integrated home screen widgets for quick daily habit check-ins without launching the app.<br>Added Firebase Crashlytics and Google Analytics to monitor stability and track user behavior.<br>Maintained a crash-free experience through detailed QA and proactive error tracking.<br>",
      "alt": "HabitBoard Img",
      "tags": ["habit tracker", "productivity"],
      "role": "Full-stack Flutter Developer",
      "techStack": [
        "Flutter",
        "Dart",
        "GetX",
        "Firebase",
        "Hive Database",
        "Crashlytics",
        "Supabase"
      ],
      "features": [
        "Customizable habit tracking with reminders",
        "Progress visualization through charts and statistics",
        "Daily motivational quotes to inspire users",
        "User-friendly interface with Material You design",
        "Built with Flutter for cross-platform support"
      ],
      "links": {
        "android": "https://play.google.com/store/apps/details?id=com.creations.bawender.habitboardnext"
      }
    }
  ]
}
